# Assignment 23

# Q1

In [1]:
import pandas as pd

In [3]:
l= [4, 8, 15, 16, 23, 42]
df = pd.Series(l)

In [5]:
type(df)

pandas.core.series.Series

In [6]:
df

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

# Q2

In [11]:
my_list = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

my_series = pd.Series(my_list)

print(my_series)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

# Q3

In [9]:
data = {"Name": ["Alice" , "Bob" , "Claire"],
        "Age" : [25,30,27],
        "Gender" : ["Female","Male","Female"]}
df1=pd.DataFrame(data)

In [10]:
df1

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

# Q4

A DataFrame can be thought of as a collection of Series, where each Series represents a column in the DataFrame. Each column in the DataFrame can have a different data type, and each column is labeled with a unique column name.

On the other hand, a Series is a one-dimensional labeled array that can hold data of any type. It is like a column in a spreadsheet or a SQL table, or a one-column DataFrame. Each element in the Series is labeled with a unique index.

The main difference between a DataFrame and a Series is that a DataFrame can hold multiple columns of data, whereas a Series can only hold a single column of data.

In [15]:
l= [4, 8, 15, 16, 23, 42]
dk = pd.Series(l)
dk # example of Series

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [13]:
data = {"Name": ["Alice" , "Bob" , "Claire"],
        "Age" : [25,30,27],
        "Gender" : ["Female","Male","Female"]}
df1=pd.DataFrame(data)

In [16]:
df1 # Example of data frame

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

# Q5

Pandas offers a wide range of functions for manipulating data in a DataFrame. Here are some common functions that you can use to manipulate data in a Pandas DataFrame:

head(n) - This function is used to display the first n rows of the DataFrame. It is useful when you want to quickly inspect the data in the DataFrame.

describe() - This function is used to generate descriptive statistics of the DataFrame. It is useful when you want to quickly understand the distribution of the data in the DataFrame.

tail(n) - This function is used to display the last n rows of the DataFrame. It is useful when you want to quickly inspect the end of the data in the DataFrame.

In [18]:
df1.head(2)
# To see first 5 data or any number of data we want by mentioning it on the bracket

    Name  Age  Gender
0  Alice   25  Female
1    Bob   30    Male

In [20]:
df1.tail(1) # To See the Data from the bottom

     Name  Age  Gender
2  Claire   27  Female

In [21]:
df1.describe() # Tells details about the int type value

             Age
count   3.000000
mean   27.333333
std     2.516611
min    25.000000
25%    26.000000
50%    27.000000
75%    28.500000
max    30.000000

# Q6

Series and DataFrame are mutable in nature, while Panel is considered to be immutable as it has been deprecated in Pandas version 0.25.0 and its functionality has been incorporated into the MultiIndex DataFrame.

# Q7

In [26]:
Classes = pd.Series([1,2,3,4,5])
Roll  = pd.Series([100,101,102,103,104])
Nam= pd.Series(["Ayan","Tiwary","kin","jin","tim"])
data1={"Name": Nam,
      "Class" : Classes,
      "Roll_Number": Roll} 
df2= pd.DataFrame(data1)

In [27]:
df2

     Name  Class  Roll_Number
0    Ayan      1          100
1  Tiwary      2          101
2     kin      3          102
3     jin      4          103
4     tim      5          104